nakhonthai/ESP32APRS_T-TWR/src/main.cpp
String deg2lat(double deg)
{
  char sign;
  if (deg > 0.0F)
  {
    sign = 'N';
  }
  else
  {
    sign = 'S';
    deg *= -1;
  }

  uint id = (uint)floor(deg);
  uint im = (uint)((deg - (double)id) * 60);
  uint imm = (uint)round((((deg - (double)id) * 60) - (double)im) * 100);
  char dmm[10];
  sprintf(dmm, "%02d%02d.%02d%c", id, im, imm, sign);
  return String(dmm);
}

String deg2lon(double deg)
{
  char sign;
  if (deg > 0.0F)
  {
    sign = 'E';
  }
  else
  {
    sign = 'W';
    deg *= -1;
  }
  uint id = (uint)floor(deg);
  uint im = (uint)((deg - (double)id) * 60);
  uint imm = (uint)round((((deg - (double)id) * 60) - (double)im) * 100);
  char dmm[10];
  sprintf(dmm, "%03d%02d.%02d%c", id, im, imm, sign);
  return String(dmm);
}

time_t setGpsTime()
{
  time_t time;
  tmElements_t timeinfo;
  if (gps.time.isValid())
  {
    timeinfo.Year = (gps.date.year()) - 1970;
    timeinfo.Month = gps.date.month();
    timeinfo.Day = gps.date.day();
    timeinfo.Hour = gps.time.hour();
    timeinfo.Minute = gps.time.minute();
    timeinfo.Second = gps.time.second();
    time_t timeStamp = makeTime(timeinfo);
    time = timeStamp + TZ * SECS_PER_HOUR;
    setTime(time);
    // setTime(timeinfo.Hour,timeinfo.Minute,timeinfo.Second,timeinfo.Day, timeinfo.Month, timeinfo.Year);
    return time;
  }
  return 0;
}

time_t getGpsTime()
{
  time_t time;
  tmElements_t timeinfo;
  if (gps.time.isValid())
  {
    timeinfo.Year = (gps.date.year()) - 1970;
    timeinfo.Month = gps.date.month();
    timeinfo.Day = gps.date.day();
    timeinfo.Hour = gps.time.hour();
    timeinfo.Minute = gps.time.minute();
    timeinfo.Second = gps.time.second();
    time_t timeStamp = makeTime(timeinfo);
    time = timeStamp + TZ * SECS_PER_HOUR;
    return time;
  }
  return 0;
}

String getValue(String data, char separator, int index)
{
  int found = 0;
  int strIndex[] = {0, -1};
  int maxIndex = data.length();

  for (int i = 0; i <= maxIndex && found <= index; i++)
  {
    if (data.charAt(i) == separator || i == maxIndex)
    {
      found++;
      strIndex[0] = strIndex[1] + 1;
      strIndex[1] = (i == maxIndex) ? i + 1 : i;
    }
  }
  return found > index ? data.substring(strIndex[0], strIndex[1]) : "";
} // END

boolean isValidNumber(String str)
{
  for (byte i = 0; i < str.length(); i++)
  {
    if (isDigit(str.charAt(i)))
      return true;
  }
  return false;
}

uint8_t checkSum(uint8_t *ptr, size_t count)
{
  uint8_t lrc, tmp;
  uint16_t i;
  lrc = 0;
  for (i = 0; i < count; i++)
  {
    tmp = *ptr++;
    lrc = lrc ^ tmp;
  }
  return lrc;
}

void saveEEPROM()
{
  uint8_t chkSum = 0;
  byte *ptr;
  ptr = (byte *)&config;
  EEPROM.writeBytes(1, ptr, sizeof(Configuration));
  chkSum = checkSum(ptr, sizeof(Configuration));
  EEPROM.write(0, chkSum);
  EEPROM.commit();
#ifdef DEBUG
  log_d("Save EEPROM ChkSUM=");
  log_d("%0X\n", chkSum);
#endif
}

void defaultConfig()
{
  log_d("Default configure mode!");
  sprintf(config.aprs_mycall, "HS5TQA");
  config.aprs_ssid = 7;
  sprintf(config.aprs_host, "aprs.dprns.com");
  config.aprs_port = 14580;
  sprintf(config.aprs_passcode, "24484");
  sprintf(config.aprs_moniCall, "%s-%d", config.aprs_mycall, config.aprs_ssid);
  sprintf(config.aprs_filter, "g/HS*/E2*");
  sprintf(config.wifi_ssid, "APRSTH");
  sprintf(config.wifi_pass, "aprsthnetwork");
  sprintf(config.wifi_ap_ssid, "ESP32IGate");
  sprintf(config.wifi_ap_pass, "aprsthnetwork");
  sprintf(config.mqtt_host, "aprs.dprns.com");
  config.wifi_client = true;
  config.synctime = true;
  config.mqtt_port = 1883;
  config.aprs_beacon = 600;
  config.gps_lat = 13.7555;
  config.gps_lon = 100.4930;
  config.gps_alt = 3;
  config.tnc = true;
  config.inet2rf = true;
  config.rf2inet = true;
  config.aprs = true;
  config.wifi = false;
  config.wifi_mode = WIFI_AP_STA_FIX;
  config.wifi_ch = 1;
  config.tnc_digi = true;
  config.tnc_telemetry = true;
  config.tnc_btext[0] = 0;
  config.tnc_beacon = 0;
  config.aprs_table = '/';
  config.aprs_symbol = '[';
  config.digi_delay = 2000;
  config.tx_timeslot = 5000;
  sprintf(config.aprs_path, "WIDE1-1");
  sprintf(config.aprs_comment, "ESP32 Internet Gateway");
  sprintf(config.tnc_comment, "ESP32 Build in TNC");
  sprintf(config.aprs_filter, "g/HS*/E2*");
  sprintf(config.tnc_path, "WIDE1-1");
  config.wifi_power = 44;
  config.input_hpf = true;
#ifdef SA818
  config.freq_rx = 144.3900;
  config.freq_tx = 144.3900;
  config.offset_rx = 0;
  config.offset_tx = 0;
  config.tone_rx = 0;
  config.tone_tx = 0;
  config.band = 0;
  config.sql_level = 1;
  config.rf_power = LOW;
  config.volume = 6;
  config.input_hpf = false;
#endif
  input_HPF = config.input_hpf;
  config.vpn = false;
  config.modem = false;
  // config.wg_port = 51820;
  // sprintf(config.wg_peer_address, "203.150.19.23");
  // sprintf(config.wg_local_address, "44.63.31.223");
  // sprintf(config.wg_netmask_address, "255.255.255.255");
  // sprintf(config.wg_gw_address, "44.63.31.193");
  // sprintf(config.wg_public_key, "");
  // sprintf(config.wg_private_key, "");
  config.timeZone = 7;
  config.oled_enable = true;
  config.oled_timeout = 60;
  config.filterMessage = true;
  config.filterStatus = false;
  config.filterTelemetry = false;
  config.filterWeather = true;
  config.filterTracker = true;
  config.filterMove = true;
  config.filterPosition = true;
  config.dispINET = true;
  config.dispTNC = true;
  config.dispDelay = 3; // Sec
  config.mygps = true;
  config.sta_smartbeacon = false;
  config.sta_compress = false;
  config.sta_altitude = true;
  config.sta_speed = true;
  config.sta_hspeed = 40;
  config.sta_lspeed = 5;
  config.sta_maxinterval = 30;
  config.sta_mininterval = 5;
  config.sta_minangle = 25;
  config.sta_slowinterval = 600;
  saveEEPROM();
}

unsigned long NTP_Timeout;
unsigned long pingTimeout;

const char *lastTitle = "LAST HERT";

int tlmList_Find(char *call)
{
  int i;
  for (i = 0; i < TLMLISTSIZE; i++)
  {
    if (strstr(Telemetry[i].callsign, call) != NULL)
      return i;
  }
  return -1;
}

int tlmListOld()
{
  int i, ret = 0;
  time_t minimum = Telemetry[0].time;
  for (i = 1; i < TLMLISTSIZE; i++)
  {
    if (Telemetry[i].time < minimum)
    {
      minimum = Telemetry[i].time;
      ret = i;
    }
    if (Telemetry[i].time > time(NULL))
      Telemetry[i].time = 0;
  }
  return ret;
}

char pkgList_Find(char *call)
{
  char i;
  for (i = 0; i < PKGLISTSIZE; i++)
  {
    if (strstr(pkgList[(int)i].calsign, call) != NULL)
      return i;
  }
  return -1;
}

int pkgList_Find(char *call, uint8_t type)
{
  int i;
  for (i = 0; i < PKGLISTSIZE; i++)
  {
    // if (type == 0) {
    //	if (strstr(pkgList[i].calsign, call) != NULL) return i;
    // }
    // else {
    if ((strstr(pkgList[i].calsign, call) != NULL) && (pkgList[i].type == type))
      return i;
    //}
  }
  return -1;
}

char pkgListOld()
{
  char i, ret = 0;
  time_t minimum = pkgList[0].time;
  for (i = 1; i < PKGLISTSIZE; i++)
  {
    if (pkgList[(int)i].time < minimum)
    {
      minimum = pkgList[(int)i].time;
      ret = i;
    }
  }
  return ret;
}

void sort(pkgListType a[], int size)
{
  pkgListType t;
  char *ptr1;
  char *ptr2;
  char *ptr3;
  ptr1 = (char *)&t;
  for (int i = 0; i < (size - 1); i++)
  {
    for (int o = 0; o < (size - (i + 1)); o++)
    {
      if (a[o].time < a[o + 1].time)
      {
        ptr2 = (char *)&a[o];
        ptr3 = (char *)&a[o + 1];
        memcpy(ptr1, ptr2, sizeof(pkgListType));
        memcpy(ptr2, ptr3, sizeof(pkgListType));
        memcpy(ptr3, ptr1, sizeof(pkgListType));
      }
    }
  }
}

