nakhonthai/ESP32APRS_T-TWR/src/main.cpp
void sortPkgDesc(pkgListType a[], int size)
{
  pkgListType t;
  char *ptr1;
  char *ptr2;
  char *ptr3;
  ptr1 = (char *)&t;
  for (int i = 0; i < (size - 1); i++)
  {
    for (int o = 0; o < (size - (i + 1)); o++)
    {
      if (a[o].pkg < a[o + 1].pkg)
      {
        ptr2 = (char *)&a[o];
        ptr3 = (char *)&a[o + 1];
        memcpy(ptr1, ptr2, sizeof(pkgListType));
        memcpy(ptr2, ptr3, sizeof(pkgListType));
        memcpy(ptr3, ptr1, sizeof(pkgListType));
      }
    }
  }
}

uint8_t pkgType(const char *raw)
{
  uint8_t type = 0;
  char packettype = 0;
  const char *info_start, *body;
  int paclen = strlen(raw);
  // info_start = (char*)strchr(raw, ':');
  // if (info_start == NULL) return 0;
  // info_start=0;
  packettype = (char)raw[0];
  body = &raw[1];

  switch (packettype)
  {
  case '=':
  case '/':
  case '@':
    if (strchr(body, 'r') != NULL)
    {
      if (strchr(body, 'g') != NULL)
      {
        if (strchr(body, 't') != NULL)
        {
          if (strchr(body, 'P') != NULL)
          {
            type = PKG_WX;
          }
        }
      }
    }
    break;
  case ':':
    type = PKG_MESSAGE;
    if (body[9] == ':' &&
        (memcmp(body + 9, ":PARM.", 6) == 0 ||
         memcmp(body + 9, ":UNIT.", 6) == 0 ||
         memcmp(body + 9, ":EQNS.", 6) == 0 ||
         memcmp(body + 9, ":BITS.", 6) == 0))
    {
      type = PKG_TELEMETRY;
    }
    break;
  case '>':
    type = PKG_STATUS;
    break;
  case '?':
    type = PKG_QUERY;
    break;
  case ';':
    type = PKG_OBJECT;
    break;
  case ')':
    type = PKG_ITEM;
    break;
  case 'T':
    type = PKG_TELEMETRY;
    break;
  case '#': /* Peet Bros U-II Weather Station */
  case '*': /* Peet Bros U-I  Weather Station */
  case '_': /* Weather report without position */
    type = PKG_WX;
    break;
  default:
    type = 0;
    break;
  }
  return type;
}

int TNC2Raw[PKGLISTSIZE];
int raw_count = 0, raw_idx_rd = 0, raw_idx_rw = 0;

void pushTNC2Raw(int raw)
{
  if (raw < 0)
    return;
  if (raw_count > PKGLISTSIZE)
    return;
  if (++raw_idx_rw >= PKGLISTSIZE)
    raw_idx_rw = 0;
  TNC2Raw[raw_idx_rw] = raw;
  raw_count++;
}

void popTNC2Raw(int &ret)
{
  String raw = "";
  int idx = 0;
  if (raw_count <= 0)
    return;
  if (++raw_idx_rd >= PKGLISTSIZE)
    raw_idx_rd = 0;
  idx = TNC2Raw[raw_idx_rd];
  if (idx < PKGLISTSIZE)
    ret = idx;
  // raw = String(pkgList[idx].raw);
  if (raw_count > 0)
    raw_count--;
  // return raw;
}

int pkgListUpdate(char *call, char *raw, uint8_t type)
{
  if (*call == 0)
    return -1;
  if (*raw == 0)
    return -1;

  int i = pkgList_Find(call, type);

  if (i > -1)
  { // Found call in old pkg
    pkgList[i].time = time(NULL);
    pkgList[i].pkg++;
    pkgList[i].type = type;
    strcpy(pkgList[i].raw, raw);
    // SerialLOG.print("Update: ");
  }
  else
  {
    i = pkgListOld();
    memset(&pkgList[i], 0, sizeof(pkgListType));
    pkgList[i].time = time(NULL);
    pkgList[i].pkg = 1;
    pkgList[i].type = type;
    strcpy(pkgList[i].calsign, call);
    strcpy(pkgList[i].raw, raw);
    pkgList[i].calsign[10] = 0;
    // SerialLOG.print("NEW: ");
  }
  return i;
  // pkgLast_array[3] = pkgLast_array[2];
  // pkgLast_array[2] = pkgLast_array[1];
  // pkgLast_array[1] = pkgLast_array[0];
  // pkgLast_array[0] = i;
  // SerialLOG.print(i, DEC);
  // SerialLOG.println(call);
}

bool pkgTxUpdate(const char *info, int delay)
{
  char *ecs = strstr(info, ">");
  if (ecs == NULL)
    return false;
  // Replace
  for (int i = 0; i < PKGTXSIZE; i++)
  {
    if (txQueue[i].Active)
    {
      if (!(strncmp(&txQueue[i].Info[0], info, info - ecs)))
      {
        strcpy(&txQueue[i].Info[0], info);
        txQueue[i].Delay = delay;
        txQueue[i].timeStamp = millis();
        return true;
      }
    }
  }

  // Add
  for (int i = 0; i < PKGTXSIZE; i++)
  {
    if (txQueue[i].Active == false)
    {
      strcpy(&txQueue[i].Info[0], info);
      txQueue[i].Delay = delay;
      txQueue[i].Active = true;
      txQueue[i].timeStamp = millis();
      break;
    }
  }
  return true;
}

bool pkgTxSend()
{
  return true;

  for (int i = 0; i < PKGTXSIZE; i++)
  {
    if (txQueue[i].Active)
    {
      int decTime = millis() - txQueue[i].timeStamp;
      if (decTime > txQueue[i].Delay)
      {
#ifdef SA818
        digitalWrite(POWER_PIN, config.rf_power); // RF Power LOW
#endif
        APRS_setPreamble(350L);
        APRS_sendTNC2Pkt(String(txQueue[i].Info)); // Send packet to RF
        txQueue[i].Active = false;
#ifdef DEBUG_TNC
        // printTime();
        log_d("TX->RF: %s\n", txQueue[i].Info);
#endif
        return true;
      }
    }
  }
  return false;
}

uint8_t *packetData;
// ฟังชั่นถูกเรียกมาจาก ax25_decode
void aprs_msg_callback(struct AX25Msg *msg)
{
  AX25Msg pkg;

  memcpy(&pkg, msg, sizeof(AX25Msg));
  PacketBuffer.push(&pkg); // ใส่แพ็จเก็จจาก TNC ลงคิวบัพเฟอร์
  // String tnc2;
  //         packet2Raw(tnc2, pkg);
  //         log_d("RX: %s", tnc2.c_str());

}

void printTime()
{
  struct tm tmstruct;
  getLocalTime(&tmstruct, 500);
  Serial.print("[");
  Serial.print(tmstruct.tm_hour);
  Serial.print(":");
  Serial.print(tmstruct.tm_min);
  Serial.print(":");
  Serial.print(tmstruct.tm_sec);
  Serial.print("]");
}

uint8_t gwRaw[PKGLISTSIZE][66];
uint8_t gwRawSize[PKGLISTSIZE];
int gwRaw_count = 0, gwRaw_idx_rd = 0, gwRaw_idx_rw = 0;

void pushGwRaw(uint8_t *raw, uint8_t size)
{
  if (gwRaw_count > PKGLISTSIZE)
    return;
  if (++gwRaw_idx_rw >= PKGLISTSIZE)
    gwRaw_idx_rw = 0;
  if (size > 65)
    size = 65;
  memcpy(&gwRaw[gwRaw_idx_rw][0], raw, size);
  gwRawSize[gwRaw_idx_rw] = size;
  gwRaw_count++;
}

uint8_t popGwRaw(uint8_t *raw)
{
  uint8_t size = 0;
  if (gwRaw_count <= 0)
    return 0;
  if (++gwRaw_idx_rd >= PKGLISTSIZE)
    gwRaw_idx_rd = 0;
  size = gwRawSize[gwRaw_idx_rd];
  memcpy(raw, &gwRaw[gwRaw_idx_rd][0], size);
  if (gwRaw_count > 0)
    gwRaw_count--;
  return size;
}

String myBeacon(String Path)
{
  // sprintf(raw, "%s-%d>APEI%s:=%s%c%s%c%s%s", Config.mycallsign, Config.myssid, VERSION, Config.mylat, Config.mysymbol[0], Config.mylon, Config.mysymbol[1], Config.myphg, Config.mycomment);
  String rawData = "";
  String lat, lon;
  double nowLat, nowLng;
  char rawTNC[300];
  char aprs_table, aprs_symbol;
  char timestamp[10];
  struct tm tmstruct;
  double dist, course, speed;
  time_t nowTime;

  memset(rawTNC, 0, sizeof(rawTNC));
  getLocalTime(&tmstruct, 5000);
  // if (config.mygps==true) {
  // if (gps.location.isValid())
  // {
  sprintf(timestamp, "%02d%02d%02d%02d", (tmstruct.tm_mon + 1), tmstruct.tm_mday, tmstruct.tm_hour, tmstruct.tm_min);
  time(&nowTime);
  // nowTime = gps.time.value();
  if (lastTimeStamp == 0)
    lastTimeStamp = nowTime;

  // lastTimeStamp=10000;
  // nowTime=lastTimeStamp+1800;
  time_t tdiff = nowTime - lastTimeStamp;

  // aprs_table = config.aprs_table;
  // aprs_symbol = config.aprs_symbol;
  if (config.sta_smartbeacon)
  {
    if (SB_SPEED < config.sta_lspeed)
    {
      aprs_table = config.sta_symstop[0];
      aprs_symbol = config.sta_symstop[1];
      SB_SPEED = 0;
    }
    else
    {
      aprs_table = config.sta_symmove[0];
      aprs_symbol = config.sta_symmove[1];
    }
  }
  else
  {
    tx_interval = config.sta_slowinterval = 60;
    aprs_table = config.mysymbol[0];
    aprs_symbol = config.mysymbol[1];
  }

  char object[10];
  memset(object, 0, 10);
  memcpy(object, config.tnc_item, strlen(config.tnc_item));
  object[9] = 0;

