nakhonthai/ESP32APRS_T-TWR/src/main.cpp
  if (gps.location.isValid())
  {
    nowLat = gps.location.lat();
    nowLng = gps.location.lng();

    // Distant= 17m
    //  LastLat=13.726841f;
    //  LastLng=100.434987f;
    //  nowLat=13.726841f;
    //  nowLng=100.434987f;

    // if (LastLng == 0)
    // 	LastLng = nowLng;
    // if (LastLat == 0)
    // 	LastLat = nowLat;
    uint16_t spdKnot;
    if (LastLng == 0 || LastLat == 0)
    {
      course = gps.course.deg();
      spdKnot = (uint16_t)gps.speed.knots();
    }
    else
    {
      dist = distance(LastLng, LastLat, nowLng, nowLat);
      course = direction(LastLng, LastLat, nowLng, nowLat);
      if (dist > 50.0F)
        dist = 0;
      if (tdiff > 10 && (nowTime > lastTimeStamp))
        speed = dist / ((double)tdiff / 3600);
      else
        speed = 0.0F;

      if (speed > 999)
        speed = 999.0F;
      // uint16_t spdMph=(uint16_t)(speed / 1.609344);
      spdKnot = (uint16_t)(speed * 0.53996F);
      if (spdKnot > 94)
        spdKnot = 0;
    }

    lat = deg2lat(nowLat);
    lon = deg2lon(nowLng);

    LastLat = nowLat;
    LastLng = nowLng;
    lastTimeStamp = nowTime;

    ESP_LOGE("GPS", "Aprs Compress");
    // Translate from semicircles to Base91 format
    char aprs_position[13];
    long latitude = semicircles((char *)lat.c_str(), (nowLat < 0));
    long longitude = semicircles((char *)lon.c_str(), (nowLat < 0));
    long ltemp = 1073741824L - latitude; // 90 degrees - latitude
    ESP_LOGE("GPS", "lat=%u lon=%u", latitude, longitude);
    memset(aprs_position, 0, sizeof(aprs_position));

    base91encode(ltemp, aprs_position);
    ltemp = 1073741824L + (longitude >> 1); // 180 degrees + longitude
    base91encode(ltemp, aprs_position + 4);
    // Encode heading
    uint8_t c = (uint8_t)(course / 4);
    // Scan lookup table to encode speed
    uint8_t s = (uint8_t)(log(spdKnot + 1) / log(1.08));
    if ((spdKnot <= 0.1) && (config.sta_altitude))
    {
      if (gps.altitude.isValid())
      {
        // Send Altitude
        aprs_position[11] = '!' + 0x30; // t current,GGA
        int alt = (int)gps.altitude.feet();
        int cs = (int)(log(alt) / log(1.002));
        c = (uint8_t)cs / 91;
        // c+='!';
        s = (uint8_t)(cs - ((int)c * 91));
        if (s > 91)
          s = 91;
        // s+='!';
        aprs_position[9] = '!' + c;  // c
        aprs_position[10] = '!' + s; // s
      }
      else
      {
        // Send Range
        aprs_position[11] = '!' + 0x00; // t current,GGA
        aprs_position[9] = '{';         // c = {
        if (!config.rf_power)
        {
          s = 10;
        }
        else
        {
          s = 30;
        }
        aprs_position[10] = '!' + s; // s
      }
    }
    else
    {
      aprs_position[9] = '!' + c;  // c
      aprs_position[10] = '!' + s; // s

      if (gps.location.isValid())
      {
        aprs_position[11] = '!' + 0x20 + 0x18 + 0x06; // t 0x20 1=current,0x18 11=RMC,0x06 110=Other tracker
      }
      else
      {
        aprs_position[11] = '!' + 0x00 + 0x18 + 0x06; // t
      }
    }
    aprs_position[12] = 0;
    // waveFlag = false;
    aprs_position[8] = aprs_symbol; // Symbol
    ESP_LOGE("GPS", "Compress=%s", aprs_position);
    if (strlen(object) >= 3)
    {
      sprintf(rawTNC, "%s-%d>APTWR1,%s:)%s!%c%s", config.aprs_mycall, config.aprs_ssid, Path.c_str(), object, aprs_table, aprs_position);
    }
    else
    {
      sprintf(rawTNC, "%s-%d>APTWR1,%s:!%c%s", config.aprs_mycall, config.aprs_ssid, Path.c_str(), aprs_table, aprs_position);
    }
  }
  else
  {
    sprintf(rawTNC, "%s-%d>APTWR1,%s:>%s ", config.aprs_mycall, config.aprs_ssid, Path.c_str(), object);
    // sprintf(rawTNC, "%s-%d>APDRH1,%s:)%s_%s", config.aprs_mycall, config.aprs_ssid, Path.c_str(), object, timestamp);
    //  sprintf(rawTNC, "%s-%d>APBT01-1%s:>%s_%s", config.aprs_mycall, config.aprs_ssid, config.aprs_path, object, timestamp);
  }

  char batStr[50];
  // uint16_t Vb = (uint16_t)(vbat * 100);
  sprintf(batStr, "Sat:%d,Bat:%0.2fV", gps.satellites.value(), vbat);
  strcat(rawTNC, batStr);
  rawData = String(rawTNC);
  return rawData;
}

#ifdef SA818
unsigned long SA818_Timeout = 0;
void SA818_INIT(bool boot)
{
#ifdef SR_FRS
  log_d("Radio Module SR_FRS Init");
#else
  log_d("Radio Module SA818/SA868 Init");
#endif
  if (boot)
  {
    SerialRF.begin(9600, SERIAL_8N1, SA868_RX_PIN, SA868_TX_PIN);
    pinMode(POWER_PIN, OUTPUT);
    pinMode(PULLDOWN_PIN, OUTPUT);
    //pinMode(SQL_PIN, INPUT);
    pinMode(PTT_PIN, OUTPUT);

    digitalWrite(PTT_PIN, LOW);
    digitalWrite(POWER_PIN, LOW);
    digitalWrite(PULLDOWN_PIN, LOW);
    delay(1000);
    digitalWrite(PTT_PIN, HIGH);
    digitalWrite(PULLDOWN_PIN, HIGH);
    delay(1500);
    SerialRF.println();
    delay(500);
  }
  SerialRF.println();
  delay(500);
  char str[100];
  if (config.sql_level > 8)
    config.sql_level = 8;
#ifdef SR_FRS
  sprintf(str, "AT+DMOSETGROUP=%01d,%0.4f,%0.4f,%d,%01d,%d,0", config.band, config.freq_tx + ((float)config.offset_tx / 1000000), config.freq_rx + ((float)config.offset_rx / 1000000), config.tone_rx, config.sql_level, config.tone_tx);
  SerialRF.println(str);
  delay(500);
  // Module auto power save setting
  SerialRF.println("AT+DMOAUTOPOWCONTR=1");
  delay(500);
  SerialRF.println("AT+DMOSETVOX=0");
  delay(500);
  SerialRF.println("AT+DMOSETMIC=6,0");
  delay(500);
  SerialRF.printf("AT+DMOSETVOLUME=%d\r\n", config.volume);
#else
  sprintf(str, "AT+DMOSETGROUP=%01d,%0.4f,%0.4f,%04d,%01d,%04d", config.band, config.freq_tx + ((float)config.offset_tx / 1000000), config.freq_rx + ((float)config.offset_rx / 1000000), config.tone_tx, config.sql_level, config.tone_rx);
  SerialRF.println(str);
  delay(500);
  SerialRF.println("AT+SETTAIL=0");
  delay(500);
  SerialRF.println("AT+SETFILTER=1,1,1");
  delay(500);
  uint8_t volume=8;
  Serial.printf("AT+DMOSETVOLUME=%d\r\n", volume);
#endif
  // SerialRF.println(str);
  // delay(500);
  // if (config.volume > 8)
  //     config.volume = 8;
  // SerialRF.printf("AT+DMOSETVOLUME=%d\r\n", config.volume);
}

