nakhonthai/ESP32APRS_T-TWR/src/main.cpp
void SA818_SLEEP()
{
  digitalWrite(POWER_PIN, LOW);
  digitalWrite(PULLDOWN_PIN, LOW);
  // SerialGPS.print("$PMTK161,0*28\r\n");
  AFSK_TimerEnable(false);
}

void SA818_CHECK()
{
  while (SerialRF.available() > 0)
    SerialRF.read();
  SerialRF.println("AT+DMOCONNECT");
  delay(100);
  if (SerialRF.available() > 0)
  {
    String ret = SerialRF.readString();
    if (ret.indexOf("DMOCONNECT") > 0)
    {
      SA818_Timeout = millis();
#ifdef DEBUG
      // Serial.println(SerialRF.readString());
      log_d("Radio SA818/SR_FRS Activated");
#endif
    }
  }
  else
  {
    log_d("Radio SA818/SR_FRS deActive");
    digitalWrite(POWER_PIN, LOW);
    digitalWrite(PULLDOWN_PIN, LOW);
    delay(500);
    SA818_INIT(true);
  }
  // SerialGPS.print("$PMTK161,0*28\r\n");
  // AFSK_TimerEnable(false);
}
#endif
// #ifdef SA818
// unsigned long SA818_Timeout = 0;
// void SA818_INIT(uint8_t HL)
// {

//     pinMode(0, INPUT);
//     pinMode(POWER_PIN, OUTPUT);
//     pinMode(PULLDOWN_PIN, OUTPUT);
//     pinMode(SQL_PIN, INPUT_PULLUP);

//     SerialRF.begin(9600, SERIAL_8N1, 14, 13);

//     digitalWrite(PULLDOWN_PIN, HIGH);
//     digitalWrite(POWER_PIN, LOW);
//     delay(500);
//     // AT+DMOSETGROUP=1,144.3900,144.3900,0,1,0,0
//     SerialRF.println("AT+DMOSETGROUP=0,144.3900,144.3900,0,1,0,0");
//     delay(10);
//     SerialRF.println("AT+DMOAUTOPOWCONTR=1");
//     delay(10);
//     SerialRF.println("AT+DMOSETVOLUME=9");
//     delay(10);
//     SerialRF.println("AT+DMOSETVOX=0");
//     delay(10);
//     SerialRF.println("AT+DMOSETMIC=8,0,0");
//     delay(100);
//     // AFSK_TimerEnable(true);
//     digitalWrite(POWER_PIN, HL);
// }

// void SA818_SLEEP()
// {
//     digitalWrite(POWER_PIN, LOW);
//     digitalWrite(PULLDOWN_PIN, LOW);
//     // SerialGPS.print("$PMTK161,0*28\r\n");
//     // AFSK_TimerEnable(false);
// }

// void SA818_CHECK()
// {
//     while (SerialRF.available() > 0)
//         SerialRF.read();
//     SerialRF.println("AT+DMOCONNECT");
//     delay(100);
//     if (SerialRF.available() > 0)
//     {
//         String ret = SerialRF.readString();
//         if (ret.indexOf("DMOCONNECT") > 0)
//         {
//             SA818_Timeout = millis();
// #ifdef DEBUG
//             // Serial.println(SerialRF.readString());
//             Serial.println("SA818 Activated");
// #endif
//         }
//     }
//     else
//     {
//         Serial.println("SA818 deActive");
//         digitalWrite(POWER_PIN, LOW);
//         digitalWrite(PULLDOWN_PIN, LOW);
//         delay(500);
//         SA818_INIT(LOW);
//     }
//     // SerialGPS.print("$PMTK161,0*28\r\n");
//     // AFSK_TimerEnable(false);
// }
// #endif

WiFiClient aprsClient;

boolean APRSConnect()
{
  // Serial.println("Connect TCP Server");
  String login = "";
  int cnt = 0;
  uint8_t con = aprsClient.connected();
  // Serial.println(con);
  if (con <= 0)
  {
    if (!aprsClient.connect(config.aprs_host, config.aprs_port)) // เชื่อมต่อกับเซิร์ฟเวอร์ TCP
    {
      // Serial.print(".");
      delay(100);
      cnt++;
      if (cnt > 50) // วนร้องขอการเชื่อมต่อ 50 ครั้ง ถ้าไม่ได้ให้รีเทิร์นฟังค์ชั่นเป็น False
        return false;
    }
    // ขอเชื่อมต่อกับ aprsc
    // if (config.aprs_ssid == 0)
    //     login = "user " + String(config.aprs_mycall) + " pass " + String(config.aprs_passcode) + " vers ESP32IGate V" + String(VERSION) + " filter " + String(config.aprs_filter);
    // else
    //     login = "user " + String(config.aprs_mycall) + "-" + String(config.aprs_ssid) + " pass " + String(config.aprs_passcode) + " vers ESP32IGate V" + String(VERSION) + " filter " + String(config.aprs_filter);
    if (strlen(config.tnc_item) >= 3)
    {
      uint16_t passcode = aprsParse.passCode(config.tnc_item);
      login = "user " + String(config.tnc_item) + " pass " + String(passcode, DEC) + " vers T-TWR+ V" + String(VERSION) + " filter " + String(config.aprs_filter);
    }
    else
    {
      if (config.aprs_ssid == 0)
        login = "user " + String(config.aprs_mycall) + " pass " + String(config.aprs_passcode) + " vers ESP32IGate V" + String(VERSION) + " filter " + String(config.aprs_filter);
      else
        login = "user " + String(config.aprs_mycall) + "-" + String(config.aprs_ssid) + " pass " + String(config.aprs_passcode) + " vers ESP32IGate V" + String(VERSION) + " filter " + String(config.aprs_filter);
    }
    aprsClient.println(login);
    // Serial.println(login);
    // Serial.println("Success");
    delay(500);
  }
  return true;
}

// boolean dataAct = false;
// uint8_t x = 0, y = 0;
// char str[300];
// String callSign;
// char callDest[8];
// char path[64];
// char raw[128];
// int posNow = 0;
// int timeHalfSec = 0;
String NMEA;

// String myBeacon(String Path)
// {
//     // sprintf(raw, "%s-%d>APEI%s:=%s%c%s%c%s%s", config.aprs_mycall, config.aprs_ssid, VERSION, config.mylat, config.mysymbol[0], config.mylon, config.mysymbol[1], config.myphg, config.mycomment);
//     String rawData = "";
//     String lat, lon;
//     char rawTNC[300];
//     char aprs_table, aprs_symbol;

//     if (config.mygps == true)
//     {
//         if (gps.location.isValid())
//         {
//             lat = aprsParse.deg2lat(gps.location.lat());
//             lon = aprsParse.deg2lon(gps.location.lng());
//             if (config.sta_smartbeacon)
//             {
//                 if (SB_SPEED < config.sta_lspeed)
//                 {
//                     aprs_table = config.sta_symstop[0];
//                     aprs_symbol = config.sta_symstop[1];
//                     SB_SPEED = 0;
//                 }
//                 else
//                 {
//                     aprs_table = config.sta_symmove[0];
//                     aprs_symbol = config.sta_symmove[1];
//                 }
//                 if (config.sta_speed && gps.speed.isValid())
//                 {
//                     if (config.sta_altitude)
//                         sprintf(rawTNC, "%s-%d>APEI%s%s:!%s%c%s%c%03d/%03d/A=%06d%s", config.aprs_mycall, config.aprs_ssid, VERSION, Path.c_str(), lat.c_str(), aprs_table, lon.c_str(), aprs_symbol, (uint16_t)gps.course.deg(), (uint16_t)gps.speed.mph(), (int16_t)gps.altitude.feet(), config.aprs_comment);
//                     else
//                         sprintf(rawTNC, "%s-%d>APEI%s%s:!%s%c%s%c%03d/%03d%s", config.aprs_mycall, config.aprs_ssid, VERSION, Path.c_str(), lat.c_str(), aprs_table, lon.c_str(), aprs_symbol, (uint16_t)gps.course.deg(), (uint16_t)gps.speed.mph(), config.aprs_comment);
//                 }
//                 else
//                 {
//                     sprintf(rawTNC, "%s-%d>APEI%s%s:!%s%c%s%c%s", config.aprs_mycall, config.aprs_ssid, VERSION, Path.c_str(), lat.c_str(), aprs_table, lon.c_str(), aprs_symbol, config.aprs_comment);
//                 }
//             }
//             else
//             {
//                 tx_interval = config.sta_slowinterval = 600;
//                 send_aprs_table = config.mysymbol[0];
//                 send_aprs_symbol = config.mysymbol[1];
//                 sprintf(rawTNC, "%s-%d>APEI%s%s:=%s%c%s%c%s", config.aprs_mycall, config.aprs_ssid, VERSION, Path.c_str(), lat.c_str(), config.mysymbol[0], lon.c_str(), config.mysymbol[1], config.aprs_comment);
//             }
//         }
//         else
//         {
//             tx_interval = config.sta_slowinterval;
//             sprintf(rawTNC, ">Wait GPS Active.");
//         }
//         send_aprs_table = aprs_table;
//         send_aprs_symbol = aprs_symbol;
//     }
//     else
//     {
//         lat = aprsParse.deg2lat(config.gps_lat);
//         lon = aprsParse.deg2lon(config.gps_lon);
//         tx_interval = config.sta_slowinterval = 600;
//         send_aprs_table = config.mysymbol[0];
//         send_aprs_symbol = config.mysymbol[1];
//         sprintf(rawTNC, "%s-%d>APEI%s%s:=%s%c%s%c%s", config.aprs_mycall, config.aprs_ssid, VERSION, Path.c_str(), lat.c_str(), config.mysymbol[0], lon.c_str(), config.mysymbol[1], config.aprs_comment);
//     }
//     // sprintf(rawTNC, "%s-%d>APEI%s:=%s%c%s%c%s%s", config.aprs_mycall, config.aprs_ssid, VERSION, lat.c_str(), config.mysymbol[0], lon.c_str(), config.mysymbol[1], config.myphg, config.mycomment);
//     return String(rawTNC);
// }

