nakhonthai/ESP32APRS_T-TWR/src/main.cpp
    /*
      The default setting is CHGLED is automatically controlled by the PMU.
    - XPOWERS_CHG_LED_OFF,
    - XPOWERS_CHG_LED_BLINK_1HZ,
    - XPOWERS_CHG_LED_BLINK_4HZ,
    - XPOWERS_CHG_LED_ON,
    - XPOWERS_CHG_LED_CTRL_CHG,
    * */
    PMU.setChargingLedMode(XPOWERS_CHG_LED_BLINK_1HZ);

    // Force add pull-up
    pinMode(PMU_IRQ, INPUT_PULLUP);
    //attachInterrupt(PMU_IRQ, setFlag, FALLING);

    // Disable all interrupts
    PMU.disableIRQ(XPOWERS_AXP2101_ALL_IRQ);
    // Clear all interrupt flags
    PMU.clearIrqStatus();
    // Enable the required interrupt function
    PMU.enableIRQ(
        XPOWERS_AXP2101_BAT_INSERT_IRQ    | XPOWERS_AXP2101_BAT_REMOVE_IRQ      |   //BATTERY
        XPOWERS_AXP2101_VBUS_INSERT_IRQ   | XPOWERS_AXP2101_VBUS_REMOVE_IRQ     |   //VBUS
        XPOWERS_AXP2101_PKEY_SHORT_IRQ    | XPOWERS_AXP2101_PKEY_LONG_IRQ       |   //POWER KEY
        XPOWERS_AXP2101_BAT_CHG_DONE_IRQ  | XPOWERS_AXP2101_BAT_CHG_START_IRQ       //CHARGE
    );

    // Set the precharge charging current
    PMU.setPrechargeCurr(XPOWERS_AXP2101_PRECHARGE_150MA);

    // Set constant current charge current limit
    //! Using inferior USB cables and adapters will not reach the maximum charging current.
    //! Please pay attention to add a suitable heat sink above the PMU when setting the charging current to 1A
    PMU.setChargerConstantCurr(XPOWERS_AXP2101_CHG_CUR_1000MA);

    // Set stop charging termination current
    PMU.setChargerTerminationCurr(XPOWERS_AXP2101_CHG_ITERM_150MA);

    // Set charge cut-off voltage
    PMU.setChargeTargetVoltage(XPOWERS_AXP2101_CHG_VOL_4V2);

    // Disable the PMU long press shutdown function
    PMU.disableLongPressShutdown();


    // Get charging target current
    const uint16_t currTable[] = {
        0, 0, 0, 0, 100, 125, 150, 175, 200, 300, 400, 500, 600, 700, 800, 900, 1000
    };
    uint8_t val = PMU.getChargerConstantCurr();
    Serial.print("Val = "); Serial.println(val);
    Serial.print("Setting Charge Target Current : ");
    Serial.println(currTable[val]);

    // Get charging target voltage
    const uint16_t tableVoltage[] = {
        0, 4000, 4100, 4200, 4350, 4400, 255
    };
    val = PMU.getChargeTargetVoltage();
    Serial.print("Setting Charge Target Voltage : ");
    Serial.println(tableVoltage[val]);

}

void setupSDCard()
{
    //SPI Bus
    SPI.begin(SPI_SCK, SPI_MISO, SPI_MOSI);

    if (SD.begin(SD_CS, SPI)) {
        uint8_t cardType = SD.cardType();
        if (cardType == CARD_NONE) {
            Serial.println("No SD_MMC card attached");
            return ;
        } else {
            Serial.print("SD_MMC Card Type: ");
            if (cardType == CARD_MMC) {
                Serial.println("MMC");
            } else if (cardType == CARD_SD) {
                Serial.println("SDSC");
            } else if (cardType == CARD_SDHC) {
                Serial.println("SDHC");
            } else {
                Serial.println("UNKNOWN");
            }
            uint32_t cardSize = SD.cardSize() / (1024 * 1024);
            uint32_t cardTotal = SD.totalBytes() / (1024 * 1024);
            uint32_t cardUsed = SD.usedBytes() / (1024 * 1024);
            Serial.printf("SD Card Size: %lu MB\n", cardSize);
            Serial.printf("Total space: %lu MB\n",  cardTotal);
            Serial.printf("Used space: %lu MB\n",   cardUsed);
        }
    }
}

long oledSleepTimeout = 0;
bool showDisp = false;
// uint8_t curTab=0;

char *htmlBuffer;
void setup()
{
  // htmlBuffer = (char*)ps_malloc(1000000);
  byte *ptr;
  pkgList = (pkgListType *)ps_malloc(sizeof(pkgListType) * PKGLISTSIZE);
  Telemetry = (TelemetryType *)ps_malloc(sizeof(TelemetryType) * TLMLISTSIZE);

  memset(pkgList, 0, sizeof(pkgListType) * PKGLISTSIZE);
  memset(Telemetry, 0, sizeof(TelemetryType) * TLMLISTSIZE);

  // pinMode(SQL_PIN, INPUT);
  //  pinMode(0, INPUT_PULLUP); // BOOT Button
  // pinMode(LED_RX, OUTPUT);
  //  pinMode(LED_TX, OUTPUT);
  //  pinMode(PWR_VDD, OUTPUT);
  //  digitalWrite(PWR_VDD, HIGH);
  //  pinMode(39, INPUT);

  // digitalWrite(keyA, LOW);
  // digitalWrite(keyB, LOW);
  // digitalWrite(keyPush, HIGH);

  // Set up serial port
  Serial.begin(115200); // debug
  //Serial.setRxBufferSize(256);
  // SerialGPS.setRxBufferSize(256);
  // SerialGPS.begin(9600, SERIAL_8N1, 18, 19);
  //  SerialTNC.setRxBufferSize(256);
  //  SerialTNC.begin(9600, SERIAL_8N1, 16, 17);

  // SerialBT.register_callback(callback);

  //   if(!SerialBT.begin("DRHotspot")){
  //     log_d("An error occurred initializing Bluetooth");
  //   }else{
  //     log_d("Bluetooth initialized");
  //   }
  //     SerialBT.enableSSP();
  //   SerialBT.onConfirmRequest(BTConfirmRequestCallback);
  //   SerialBT.onAuthComplete(BTAuthCompleteCallback);
  //     SerialBT.begin("DRHotspot");

  // while(1){
  //     if(SerialBT.available()){
  //     Serial.write(SerialBT.read());
  // }
  // }

  // Serial.println();
  log_d("Start ESP32IGate V%s", String(VERSION).c_str());
  log_d("Push BOOT after 3 sec for Factory Default config.");

  log_d("Total heap: %d", ESP.getHeapSize());

  Wire.begin(I2C_SDA, I2C_SCL, 400000L);
  
  setupPower();

  setupSDCard();
  // bool result = PMU.begin(Wire, AXP2101_SLAVE_ADDRESS, I2C_SDA, I2C_SCL);

  // if (result == false)
  // {
  //   Serial.println("PMU is not online...");
  //   // while (1)
  //   //   delay(50);
  // }

  // Serial.printf("getID:0x%x\n", PMU.getChipID());

  // // Set the minimum common working voltage of the PMU VBUS input,
  // // below this value will turn off the PMU
  // PMU.setVbusVoltageLimit(XPOWERS_AXP2101_VBUS_VOL_LIM_4V36);

  // // Set the maximum current of the PMU VBUS input,
  // // higher than this value will turn off the PMU
  // PMU.setVbusCurrentLimit(XPOWERS_AXP2101_VBUS_CUR_LIM_1500MA);

  // // Get the VSYS shutdown voltage
  // uint16_t vol = PMU.getSysPowerDownVoltage();
  // Serial.printf("->  getSysPowerDownVoltage:%u\n", vol);

  // // Set VSY off voltage as 2600mV , Adjustment range 2600mV ~ 3300mV
  // PMU.setSysPowerDownVoltage(2600);

  // // It is necessary to disable the detection function of the TS pin on the board
  // // without the battery temperature detection function, otherwise it will cause abnormal charging
  // PMU.disableTSPinMeasure();

  // // PMU.enableTemperatureMeasure();

