nakhonthai/ESP32APRS_T-TWR/src/main.cpp
  // // Enable internal ADC detection
  // PMU.enableBattDetection();
  // PMU.enableVbusVoltageMeasure();
  // PMU.enableBattVoltageMeasure();
  // PMU.enableSystemVoltageMeasure();

  // // Set the precharge charging current
  // PMU.setPrechargeCurr(XPOWERS_AXP2101_PRECHARGE_200MA);

  // // Set stop charging termination current
  // PMU.setChargerTerminationCurr(XPOWERS_AXP2101_CHG_ITERM_25MA);

  // uint16_t targetVol;

  // // OLED_VCC
  // // vol = 3300;
  // // PMU.disableDC1();
  // // delay(100);
  // // PMU.setDC1Voltage(vol);
  // // delay(1);
  // // targetVol = PMU.getDC1Voltage();
  // // Serial.printf("BLDO1  :%s   Voltage:%u mV \n", PMU.isEnableDC1() ? "ENABLE" : "DISABLE", targetVol);
  // // if (targetVol != vol)
  // //   Serial.println(">>> FAILED!");

  // // PMU.setDC1Voltage(3300);
  // //! DC3 Radio VDD , Don't change
  // PMU.setDC3Voltage(3400);
  // PMU.disableDC2();
  // PMU.disableDC4();
  // PMU.disableDC5();

  // //! ALDO2 MICRO TF Card VDD, Don't change
  // vol = 3300;
  // PMU.setALDO2Voltage(vol);
  // delay(1);
  // targetVol = PMU.getALDO2Voltage();
  // Serial.printf("SD_VCC  :%s   Voltage:%u mV \n", PMU.isEnableALDO2() ? "ENABLE" : "DISABLE", targetVol);
  // if (targetVol != vol)
  //   Serial.println(">>> FAILED!");

  // //! ALDO4 GNSS VDD, Don't change
  // vol = 3300;
  // PMU.setALDO4Voltage(vol);
  // delay(1);
  // targetVol = PMU.getALDO4Voltage();
  // Serial.printf("GNSS_VCC  :%s   Voltage:%u mV \n", PMU.isEnableALDO4() ? "ENABLE" : "DISABLE", targetVol);
  // if (targetVol != vol)
  //   Serial.println(">>> FAILED!");

  // //! BLDO1 MIC VDD, Don't change
  // vol = 3300;
  // PMU.setBLDO1Voltage(vol);
  // delay(1);
  // targetVol = PMU.getBLDO1Voltage();
  // Serial.printf("MIC_VCC  :%s   Voltage:%u mV \n", PMU.isEnableBLDO1() ? "ENABLE" : "DISABLE", targetVol);
  // if (targetVol != vol)
  //   Serial.println(">>> FAILED!");

  // //! The following supply voltages can be controlled by the user
  // // DC5 IMAX=2A
  // // 1200mV
  // // 1400~3700mV,100mV/step,24steps
  // PMU.setDC5Voltage(3300);

  // // ALDO1 IMAX=300mA
  // // 500~3500mV, 100mV/step,31steps
  // PMU.setALDO1Voltage(3300);

  // // ALDO3 IMAX=300mA
  // // 500~3500mV, 100mV/step,31steps
  // PMU.setALDO3Voltage(3300);

  // // BLDO2 IMAX=300mA
  // // 500~3500mV, 100mV/step,31steps
  // PMU.setBLDO2Voltage(3300);

  // // Turn on the power that needs to be used
  // PMU.enableDC3();
  // PMU.enableDC5();
  // PMU.enableALDO1();
  // PMU.enableALDO2();
  // PMU.enableALDO3();
  // PMU.enableALDO4();
  // PMU.enableBLDO1();
  // PMU.enableBLDO2();

#ifdef OLED
  // Wire1.setClock(400000L);

  // by default, we'll generate the high voltage from the 3.3v line internally! (neat!)
  display.begin(SSD1306_SWITCHCAPVCC, 0x3C, false); // initialize with the I2C addr 0x3C (for the 128x64)
  // Initialising the UI will init the display too.
  // display.init();
  // // clear the display
  // display.clear();
  // display.flipScreenVertically();
  // display.setTextAlignment(TEXT_ALIGN_LEFT);
  // display.drawString(128, 54, String(millis()));
  //  write the buffer to the display
  display.clearDisplay();
  display.setTextSize(1);
  display.setTextColor(WHITE);

  display.setTextSize(1);
  display.setFont(&FreeSansBold9pt7b);
  display.setCursor(0, 15);
  display.print("APRS");
  display.setCursor(55, 32);
  display.print("T-TWR+");
  display.drawYBitmap(0, 16, LOGO, 48, 48, WHITE);
  display.drawRoundRect(52, 16, 75, 22, 3, WHITE);

  display.setFont();
  display.setTextColor(WHITE);
  // display.setCursor(30, 5);
  // display.print("ESP32 IGATE");

  display.setCursor(55, 40);
  display.print("Version " + String(VERSION));
  display.setCursor(60, 55);
  display.print("Copy@2023");
  // display.drawLine(10, 30, 110, 30, WHITE);
  // display.setCursor(1, 40);
  // display.print("Push B Factory reset");
  // topBar(-100);
  display.display();
#endif

  if (!EEPROM.begin(EEPROM_SIZE))
  {
    log_d("failed to initialise EEPROM"); // delay(100000);
  }

#ifdef OLED
  delay(1000);
  // digitalWrite(LED_TX, HIGH);
  // display.setCursor(50, 50);
  // display.print("3 Sec");
  // display.display();
  // delay(1000);
  // digitalWrite(LED_RX, HIGH);
  // display.setCursor(40, 50);
  // display.print("        ");
  // display.display();
  // display.setCursor(50, 50);
  // display.print("2 Sec");
  // display.display();
  // delay(1000);
  // display.setCursor(40, 50);
  // display.print("        ");
  // display.display();
  // display.setCursor(50, 50);
  // display.print("1 Sec");
  // display.display();
#else
  delay(1000);
  digitalWrite(LED_TX, HIGH);
  delay(1000);
  digitalWrite(LED_RX, HIGH);
  delay(1000);
#endif
//   if (digitalRead(0) == LOW)
//   {
//     defaultConfig();
//     log_d("Manual Default configure!");
// #ifdef OLED
//     display.clearDisplay();
//     display.setCursor(10, 22);
//     display.print("Factory Reset!");
//     display.display();
// #endif
//     //   while (digitalRead(0) == LOW)
//     //   {
//     //     delay(500);
//     //     digitalWrite(LED_TX, LOW);
//     //     digitalWrite(LED_RX, LOW);
//     //     delay(500);
//     //     digitalWrite(LED_TX, HIGH);
//     //     digitalWrite(LED_RX, HIGH);
//     //   }
//     }

    // digitalWrite(LED_TX, LOW);
    // digitalWrite(LED_RX, LOW);

    // ตรวจสอบคอนฟิกซ์ผิดพลาด
    ptr = (byte *)&config;
    EEPROM.readBytes(1, ptr, sizeof(Configuration));
    uint8_t chkSum = checkSum(ptr, sizeof(Configuration));
    log_d("EEPROM Check %0Xh=%0Xh(%dByte)\n", EEPROM.read(0), chkSum, sizeof(Configuration));
    if (EEPROM.read(0) != chkSum)
    {
      log_d("Config EEPROM Error!");
      defaultConfig();
    }
    input_HPF = config.input_hpf;

#ifdef SA818
    SA818_INIT(true);
#endif

#ifdef OLED
    display.clearDisplay();
    display.setTextSize(1);
    display.display();
#endif

    // pkgListType pkgList[PKGLISTSIZE];
    // pkgList = (pkgListType*)ps_malloc(sizeof(pkgListType)*PKGLISTSIZE);

    log_d("Free heap: %d", ESP.getFreeHeap());
    log_d("Total PSRAM: %d", ESP.getPsramSize());
    log_d("Free PSRAM: %d", ESP.getFreePsram());
    // log_d("Used PSRAM: %d", ESP.getPsramSize() - ESP.getFreePsram());

    // enableLoopWDT();
    // enableCore0WDT();
    // enableCore1WDT();
    firstGpsTime = true;

    // Task 1
    xTaskCreatePinnedToCore(
        taskAPRS,        /* Function to implement the task */
        "taskAPRS",      /* Name of the task */
        8192,            /* Stack size in words */
        NULL,            /* Task input parameter */
        1,               /* Priority of the task */
        &taskAPRSHandle, /* Task handle. */
        0);              /* Core where the task should run */

    xTaskCreatePinnedToCore(
        taskGPS,        /* Function to implement the task */
        "taskGPS",      /* Name of the task */
        4096,           /* Stack size in words */
        NULL,           /* Task input parameter */
        2,              /* Priority of the task */
        &taskGpsHandle, /* Task handle. */
        0);             /* Core where the task should run */

    // if (config.wifi == true)
    // {
    //   // Task 2
    //   xTaskCreatePinnedToCore(
    //       taskNetwork,        /* Function to implement the task */
    //       "taskNetwork",      /* Name of the task */
    //       8192,               /* Stack size in words */
    //       NULL,               /* Task input parameter */
    //       2,                  /* Priority of the task */
    //       &taskNetworkHandle, /* Task handle. */
    //       1);                 /* Core where the task should run */
    // }
    // Task 3
    xTaskCreatePinnedToCore(
        mainDisp,           /* Function to implement the task */
        "mainDisplay",      /* Name of the task */
        16384,               /* Stack size in words */
        NULL,               /* Task input parameter */
        1,                  /* Priority of the task */
        &mainDisplayHandle, /* Task handle. */
        1);                 /* Core where the task should run */
  }

  int pkgCount = 0;

  float conv_coords(float in_coords)
  {
    // Initialize the location.
    float f = in_coords;
    // Get the first two digits by turning f into an integer, then doing an integer divide by 100;
    // firsttowdigits should be 77 at this point.
    int firsttwodigits = ((int)f) / 100; // This assumes that f < 10000.
    float nexttwodigits = f - (float)(firsttwodigits * 100);
    float theFinalAnswer = (float)(firsttwodigits + nexttwodigits / 60.0);
    return theFinalAnswer;
  }

  void DD_DDDDDtoDDMMSS(float DD_DDDDD, int *DD, int *MM, int *SS)
  {

    *DD = (int)DD_DDDDD;                       // сделали из 37.45545 это 37 т.е. Градусы
    *MM = (int)((DD_DDDDD - *DD) * 60);        // получили минуты
    *SS = ((DD_DDDDD - *DD) * 60 - *MM) * 100; // получили секунды
  }

  String send_fix_location()
  {
    String tnc2Raw = "";
    int lat_dd, lat_mm, lat_ss, lon_dd, lon_mm, lon_ss;
    char strtmp[300], loc[30];
    memset(strtmp, 0, 300);
    DD_DDDDDtoDDMMSS(config.gps_lat, &lat_dd, &lat_mm, &lat_ss);
    DD_DDDDDtoDDMMSS(config.gps_lon, &lon_dd, &lon_mm, &lon_ss);
    // sprintf(loc, "!%02d%02d.%02dN%c%03d%02d.%02dE%c", lat_dd, lat_mm, lat_ss, config.aprs_table, lon_dd, lon_mm, lon_ss, config.aprs_symbol);
    if (strlen(config.tnc_item) >= 3)
    {
      sprintf(loc, ")%s!%02d%02d.%02dN%c%03d%02d.%02dE%c", config.tnc_item, lat_dd, lat_mm, lat_ss, config.aprs_table, lon_dd, lon_mm, lon_ss, config.aprs_symbol);
    }
    else
    {
      sprintf(loc, "!%02d%02d.%02dN%c%03d%02d.%02dE%c", lat_dd, lat_mm, lat_ss, config.aprs_table, lon_dd, lon_mm, lon_ss, config.aprs_symbol);
    }
    if (config.aprs_ssid == 0)
      sprintf(strtmp, "%s>APDRH1", config.aprs_mycall);
    else
      sprintf(strtmp, "%s-%d>APDRH1", config.aprs_mycall, config.aprs_ssid);
    tnc2Raw = String(strtmp);
    if (config.aprs_path[0] != 0)
    {
      tnc2Raw += ",";
      tnc2Raw += String(config.aprs_path);
    }
    tnc2Raw += ":";
    char object[10];
    memset(object, 0, 10);
    memcpy(object, config.tnc_item, strlen(config.tnc_item));
    object[9] = 0;
    if (strlen(object) > 3)
    {
      tnc2Raw += ")" + String(object);
    }
    tnc2Raw += String(loc);
    tnc2Raw += String(config.aprs_comment);
    return tnc2Raw;
  }

  int packet2Raw(String & tnc2, AX25Msg & Packet)
  {
    if (Packet.len < 5)
      return 0;
    tnc2 = String(Packet.src.call);
    if (Packet.src.ssid > 0)
    {
      tnc2 += String(F("-"));
      tnc2 += String(Packet.src.ssid);
    }
    tnc2 += String(F(">"));
    tnc2 += String(Packet.dst.call);
    if (Packet.dst.ssid > 0)
    {
      tnc2 += String(F("-"));
      tnc2 += String(Packet.dst.ssid);
    }
    for (int i = 0; i < Packet.rpt_count; i++)
    {
      tnc2 += String(",");
      tnc2 += String(Packet.rpt_list[i].call);
      if (Packet.rpt_list[i].ssid > 0)
      {
        tnc2 += String("-");
        tnc2 += String(Packet.rpt_list[i].ssid);
      }
      if (Packet.rpt_flags & (1 << i))
        tnc2 += "*";
    }
    tnc2 += String(F(":"));
    tnc2 += String((const char *)Packet.info);
    tnc2 += String("\n");

    // #ifdef DEBUG_TNC
    //     Serial.printf("[%d] ", ++pkgTNC_count);
    //     Serial.print(tnc2);
    // #endif
    return tnc2.length();
  }

  long sendTimer = 0;
  bool AFSKInitAct = false;
  int btn_count = 0;
  long timeCheck = 0;

  void loop()
  {
    vTaskDelay(10 / portTICK_PERIOD_MS);

    if (digitalRead(0) == LOW)
    {
      btn_count++;
      if (btn_count > 1000) // Push BOOT 10sec
      {
        //digitalWrite(LED_PIN, HIGH);
        // digitalWrite(LED_TX_PIN, HIGH);
      }
    }
    else
    {
      if (btn_count > 0)
      {
        // Serial.printf("btn_count=%dms\n", btn_count * 10);
        if (btn_count > 1000) // Push BOOT 10sec to Factory Default
        {
          // digitalWrite(LED_RX, LOW);
          // digitalWrite(LED_TX, LOW);
          // defaultConfig();
          log_d("SYSTEM REBOOT NOW!");
          // esp_restart();
        }
        else
        {
          EVENT_TX_POSITION = 1;
          //     showDisp=true;
          //     if( oledSleepTimeout>0){
          //     curTab++;
          //     if(curTab>3) curTab=0;
          //     }
          //     log_d("curTab: %d",curTab);
        }
        btn_count = 0;
      }
    }

    if (millis() > timeCheck)
    {
      // log_d("taskAPRS: %d mS\ttaskNetwork: %d mS\ttaskGUI: %d mS\n", timeAprs, timeNetwork, timeGui);
      timeCheck = millis() + 1000;
      // if (ESP.getFreeHeap() < 60000)
      //     esp_restart();
      // Serial.println(String(ESP.getFreeHeap()));
      // Popup Display
      // if (dispBuffer.getCount() > 0)
      // {
      //     if (millis() > timeHalfSec)
      //     {
      //         char tnc2[300];
      //         dispBuffer.pop(&tnc2);
      //         dispWindow(String(tnc2), 0, false);
      //     }
      // }
      // else
      // {
      //     // Sleep display
      //     if (millis() > timeHalfSec)
      //     {
      //         if (timeHalfSec > 0)
      //         {
      //             timeHalfSec = 0;
      //             oledSleepTimeout = millis() + (config.oled_timeout * 1000);
      //         }
      //         else
      //         {
      //             if (millis() > oledSleepTimeout && oledSleepTimeout > 0)
      //             {
      //                 oledSleepTimeout = 0;
      //                 display.clearDisplay();
      //                 display.display();
      //             }
      //         }
      //     }
      // }
    }
#ifdef SA818
// if (SerialRF.available())
// {
//     Serial.print(Serial.readString());
// }
#endif

