nakhonthai/ESP32APRS_T-TWR/src/main.cpp
  }

  String sendIsAckMsg(String toCallSign, int msgId)
  {
    char str[300];
    char call[11];
    int i;
    memset(&call[0], 0, 11);
    sprintf(call, "%s-%d", config.aprs_mycall, config.aprs_ssid);
    strcpy(&call[0], toCallSign.c_str());
    i = strlen(call);
    for (; i < 9; i++)
      call[i] = 0x20;
    memset(&str[0], 0, 300);

    sprintf(str, "%s-%d>APE32I%s::%s:ack%d", config.aprs_mycall, config.aprs_ssid, VERSION, call, msgId);
    //	client.println(str);
    return String(str);
  }

  void sendIsPkg(char *raw)
  {
    char str[300];
    sprintf(str, "%s-%d>APE32I%s:%s", config.aprs_mycall, config.aprs_ssid, VERSION, raw);
    // client.println(str);
    String tnc2Raw = String(str);
    if (aprsClient.connected())
      aprsClient.println(tnc2Raw); // Send packet to Inet
    if (config.tnc && config.tnc_digi)
      pkgTxUpdate(str, 0);
  }

  void sendIsPkgMsg(char *raw)
  {
    char str[300];
    char call[11];
    int i;
    memset(&call[0], 0, 11);
    if (config.aprs_ssid == 0)
      sprintf(call, "%s", config.aprs_mycall);
    else
      sprintf(call, "%s-%d", config.aprs_mycall, config.aprs_ssid);
    i = strlen(call);
    for (; i < 9; i++)
      call[i] = 0x20;

    if (config.aprs_ssid == 0)
      sprintf(str, "%s>APE32I::%s:%s", config.aprs_mycall, call, raw);
    else
      sprintf(str, "%s-%d>APE32I::%s:%s", config.aprs_mycall, config.aprs_ssid, call, raw);

    String tnc2Raw = String(str);
    if (aprsClient.connected())
      aprsClient.println(tnc2Raw); // Send packet to Inet
    if (config.tnc && config.tnc_digi)
      pkgTxUpdate(str, 0);
    // APRS_sendTNC2Pkt(tnc2Raw); // Send packet to RF
  }

  void taskGPS(void *pvParameters)
  {
    unsigned long gpsTickInterval;
    GPS_INIT();
    for (;;)
    {
      vTaskDelay(10 / portTICK_PERIOD_MS);
      // if (millis() > gpsTickInterval)
      // {
      //     gpsTickInterval = millis() + 1000;
      // ESP_LOGE("FreeHEAP", "%d", esp_get_free_heap_size());
      while (SerialGPS.available())
        gps.encode(SerialGPS.read());

      if (firstGpsTime && gps.time.isValid())
      {
        if (gps.time.isUpdated())
        {

          // if (Config.wifi_enable == false ) {
          time_t timeGps = getGpsTime();
          if (timeGps > 1653152400 && timeGps < 2347462800)
          {
            setTime(timeGps);
            time_t rtc = timeGps;
            timeval tv = {rtc, 0};
            timezone tz = {TZ_SEC + DST_MN, 0};
            settimeofday(&tv, &tz);
// setSyncProvider(getGpsTime);
// setSyncInterval(600);
#ifdef DEBUG
            log_d("\nSET GPS Timestamp = %u Year=%d\n", timeGps, year());
#endif
            // firstGpsTime = false;
            firstGpsTime = false;
            if (startTime == 0)
              startTime = now();
          }
          else
          {
            startTime = 0;
          }
          //}
        }
      }
      //}
    }
  }

  long timeSlot;
  void taskAPRS(void *pvParameters)
  {
    //	long start, stop;
    char *raw;
    char *str;
    // bool firstGpsTime = true;
    unsigned long tickInterval;

    log_d("Task APRS has been start");
    PacketBuffer.clean();

    APRS_init();
    APRS_setCallsign(config.aprs_mycall, config.aprs_ssid);
    APRS_setPath1(config.aprs_path, 1);
    APRS_setPreamble(300);
    APRS_setTail(0);
    sendTimer = millis() - (config.aprs_beacon * 1000) + 30000;
    igateTLM.TeleTimeout = millis() + 60000; // 1Min
    AFSKInitAct = true;
    timeSlot = millis();
    timeAprs = 0;
    //AFSK_TimerEnable(true);

    unsigned long timeAprsOld = millis();
    unsigned long gpsTimeout;
    for (;;)
    {
      unsigned long now = millis();
      timeAprs = now - timeAprsOld;
      timeAprsOld = now;
      // wdtSensorTimer = now;
      time_t timeStamp;
      time(&timeStamp);
      vTaskDelay(1 / portTICK_PERIOD_MS);
      // serviceHandle();

          if (AFSKInitAct == true)
    {
#ifdef SA818
      AFSK_Poll(true, config.rf_power);
#else
      AFSK_Poll(false, LOW);
#endif
    }

      // Transmit in timeslot if enabled
      if (millis() > tickInterval)
      {
        tickInterval = millis() + 1000;
        if (ESP.getFreeHeap() < 60000)
          ESP.restart();
        tx_counter++;
        if (config.sta_smartbeacon)
        {
          if (tx_counter > tx_interval)
          {
            if (tx_counter > config.sta_mininterval)
              EVENT_TX_POSITION = 1;
          }
          else
          {
            if (tx_counter >= (tx_interval + 5))
            {
              EVENT_TX_POSITION = 1;
            }
          }
        }
        else if (tx_counter > tx_interval)
        {
          EVENT_TX_POSITION = 1;
          tx_interval = 60;
        }

        if (config.mygps && gps.speed.isValid())
        {
          // if ((SB_SPEED_OLD == 0 && gps.speed.kmph() > 150.0F)) gps.speed.kmph() = 0.0F;
          SB_SPEED_OLD = SB_SPEED;
          SB_SPEED = (unsigned char)gps.speed.kmph();
          // SB_HEADING=(unsigned char)((fixdata.velocity >> 16) & 0xff);
          SB_HEADING = (int16_t)gps.course.deg();
          if (config.sta_smartbeacon)
          {
            if (SB_SPEED < config.sta_lspeed && SB_SPEED_OLD > config.sta_lspeed)
            { // STOPING
              SB_SPEED_OLD = 0;
              // tx_counter=tx_interval;
              if (tx_counter > config.sta_mininterval)
                EVENT_TX_POSITION = 1;
              tx_interval = config.sta_slowinterval;
            }
            else
            {
              smartbeacon();
            }
          }
          else if (tx_counter > tx_interval)
          { // send gps location
            EVENT_TX_POSITION = 1;
            tx_interval = 300;
          }
        }
        else // send fix location
        {
          tx_interval = 900;
        }
      }

      if (now > (timeSlot + 10))
      {
        if (!digitalRead(34))
        { // RX State Fail
          if (pkgTxSend())
            timeSlot = millis() + config.tx_timeslot; // Tx Time Slot = 5sec.
          else
            timeSlot = millis();
        }
        else
        {
          timeSlot = millis() + 500;
        }
      }

