nakhonthai/ESP32APRS_T-TWR/src/main.cpp
      // if (config.tnc_telemetry)
      // {
      //     if (igateTLM.TeleTimeout < millis())
      //     {
      //         igateTLM.TeleTimeout = millis() + 600000; // 10Min
      //         if ((igateTLM.Sequence % 6) == 0)
      //         {
      //             sendIsPkgMsg((char *)&PARM[0]);
      //             sendIsPkgMsg((char *)&UNIT[0]);
      //             sendIsPkgMsg((char *)&EQNS[0]);
      //         }
      //         char rawTlm[100];
      //         if (config.aprs_ssid == 0)
      //             sprintf(rawTlm, "%s>APE32I:T#%03d,%d,%d,%d,%d,%d,00000000", config.aprs_mycall, igateTLM.Sequence, igateTLM.RF2INET, igateTLM.INET2RF, igateTLM.RX, igateTLM.TX, igateTLM.DROP);
      //         else
      //             sprintf(rawTlm, "%s-%d>APE32I:T#%03d,%d,%d,%d,%d,%d,00000000", config.aprs_mycall, config.aprs_ssid, igateTLM.Sequence, igateTLM.RF2INET, igateTLM.INET2RF, igateTLM.RX, igateTLM.TX, igateTLM.DROP);

      //         if (aprsClient.connected())
      //             aprsClient.println(String(rawTlm)); // Send packet to Inet
      //         if (config.tnc && config.tnc_digi)
      //             pkgTxUpdate(rawTlm, 0);
      //         // APRS_sendTNC2Pkt(String(rawTlm)); // Send packet to RF
      //         igateTLM.Sequence++;
      //         if (igateTLM.Sequence > 999)
      //             igateTLM.Sequence = 0;
      //         igateTLM.DROP = 0;
      //         igateTLM.INET2RF = 0;
      //         igateTLM.RF2INET = 0;
      //         igateTLM.RX = 0;
      //         igateTLM.TX = 0;
      //         // client.println(raw);
      //     }
      // }

      // IGate RF->INET
      // if (config.tnc)
      {
        if (PacketBuffer.getCount() > 0)
        {
          String tnc2;
          // นำข้อมูลแพ็จเกจจาก TNC ออกจากคิว
          PacketBuffer.pop(&incomingPacket);
          // igateProcess(incomingPacket);
          packet2Raw(tnc2, incomingPacket);

          // if (config.dispTNC == true){
          //     if(!dispBuffer.isFull()) dispBuffer.push(tnc2.c_str());
          // }

          log_d("RX: %s", tnc2.c_str());

          // SerialBT.println(tnc2);
          uint8_t type = pkgType((char *)incomingPacket.info);
          char call[11];
          if (incomingPacket.src.ssid > 0)
            sprintf(call, "%s-%d", incomingPacket.src.call, incomingPacket.src.ssid);
          else
            sprintf(call, "%s", incomingPacket.src.call);

          int idx = pkgListUpdate(call, (char *)tnc2.c_str(), type);
          pushTNC2Raw(idx);

          // IGate Process
          if (config.rf2inet && aprsClient.connected())
          {
            int ret = igateProcess(incomingPacket);
            if (ret == 0)
            {
              status.dropCount++;
              igateTLM.DROP++;
            }
            else
            {
              status.rf2inet++;
              igateTLM.RF2INET++;
              igateTLM.TX++;
#ifdef DEBUG
              // printTime();
              // log_d("RF->INET: ");
              // log_d("%s\n", tnc2.c_str());
#endif
              // char call[11];
              // if (incomingPacket.src.ssid > 0)
              //     sprintf(call, "%s-%d", incomingPacket.src.call, incomingPacket.src.ssid);
              // else
              //     sprintf(call, "%s", incomingPacket.src.call);

              // uint8_t type = pkgType((char*)incomingPacket.info);
              // pkgListUpdate(call,(char *)tnc2.c_str(), type);
            }
          }

          // Digi Repeater Process
          if (config.tnc_digi)
          {
            int dlyFlag = digiProcess(incomingPacket);
            if (dlyFlag > 0)
            {
              int digiDelay;
              status.digiCount++;
              if (dlyFlag == 1)
              {
                digiDelay = 0;
              }
              else
              {
                if (config.digi_delay == 0)
                { // Auto mode
                  if (digiCount > 20)
                    digiDelay = random(5000);
                  else if (digiCount > 10)
                    digiDelay = random(3000);
                  else if (digiCount > 0)
                    digiDelay = random(1500);
                  else
                    digiDelay = random(500);
                }
                else
                {
                  digiDelay = random(config.digi_delay);
                }
              }
              String digiPkg;
              packet2Raw(digiPkg, incomingPacket);
              pkgTxUpdate(digiPkg.c_str(), digiDelay);
            }
          }

          lastPkg = true;
          lastPkgRaw = tnc2;
          // ESP_BT.println(tnc2);
          status.allCount++;
        }
      }

      if (EVENT_TX_POSITION == 1)
      {
        powerWakeup();
        String rawData;
        if (config.mygps)
        {
          if (!gps.location.isValid())
          {
            continue;
          }
          rawData = myBeacon(String(config.aprs_path));
        }
        else
        {
          rawData = send_fix_location();
          tx_interval = config.aprs_beacon;
        }
        tx_counter = 0;
        EVENT_TX_POSITION = 0;
        //                         pkgTxUpdate(tnc2Raw.c_str(), 0);
        //                         // APRS_sendTNC2Pkt(tnc2Raw); // Send packet to RF
        log_d("Send RAW: %s\n", rawData.c_str());      
        dispFlagTX=1;
        // digitalWrite(POWER_PIN, RF_PWR); // set RF Power H/L
        //AFSK_TimerEnable(true);
        APRS_sendTNC2Pkt(rawData);
        for (int i = 0; i < 100; i++)
        {
          if (digitalRead(PTT_PIN))
            break;
          delay(50); // TOT 5sec
        }
        LED_Color(0, 0, 0);
        digitalWrite(POWER_PIN, 0); // set RF Power Low
        if (aprsClient.connected()){
          aprsClient.println(rawData); // Send packet to Inet
          //dispTX(0);
        }
      }
    }
  }

  int mqttRetry = 0;
  long wifiTTL = 0;
  WiFiMulti wifiMulti;

  void taskNetwork(void *pvParameters)
  {
    int c = 0;
    log_d("Task Network has been start");
    //     pinMode(MODEM_PWRKEY, OUTPUT);
    //         // Pull down PWRKEY for more than 1 second according to manual requirements
    //     digitalWrite(MODEM_PWRKEY, HIGH);
    //     delay(100);
    //     digitalWrite(MODEM_PWRKEY, LOW);
    //     delay(1000);
    //     digitalWrite(MODEM_PWRKEY, HIGH);

