nakhonthai/ESP32APRS_T-TWR/src/main.cpp
    // Serial1.begin(115200, SERIAL_8N1, MODEM_RX, MODEM_TX);
    //   Serial1.setTimeout(10);
    //   Serial1.setRxBufferSize(2048);
    //   ppp.begin(&Serial1);

    //   Serial.print("Connecting PPPoS");
    //   ppp.connect(PPP_APN, PPP_USER, PPP_PASS);
    //   while (!ppp.status()) {
    //     delay(500);
    //     Serial.print(".");
    //   }
    //   Serial.println("OK");

    // if (config.wifi_mode == WIFI_AP_STA_FIX || config.wifi_mode == WIFI_AP_FIX)
    // { // AP=false
    //     // WiFi.mode(config.wifi_mode);
    //     if (config.wifi_mode == WIFI_AP_STA_FIX)
    //     {
    //         WiFi.mode(WIFI_AP_STA);
    //     }
    //     else if (config.wifi_mode == WIFI_AP_FIX)
    //     {
    //         WiFi.mode(WIFI_AP);
    //     }
    //     //กำหนดค่าการทำงานไวไฟเป็นแอสเซสพ้อย
    //     WiFi.softAP(config.wifi_ap_ssid, config.wifi_ap_pass); // Start HOTspot removing password will disable security
    //     WiFi.softAPConfig(local_IP, gateway, subnet);
    //     Serial.print("Access point running. IP address: ");
    //     Serial.print(WiFi.softAPIP());
    //     Serial.println("");
    // }
    // else if (config.wifi_mode == WIFI_STA_FIX)
    // {
    //     WiFi.mode(WIFI_STA);
    //     WiFi.disconnect();
    //     delay(100);
    //     Serial.println(F("WiFi Station Only mode."));
    // }
    // else
    // {
    //     WiFi.mode(WIFI_OFF);
    //     WiFi.disconnect(true);
    //     delay(100);
    //     Serial.println(F("WiFi OFF All mode."));
    //     SerialBT.begin("ESP32TNC");
    // }

    // webService();

    WiFi.mode(WIFI_STA);
    wifiMulti.addAP(config.wifi_ssid, config.wifi_pass);
    wifiMulti.addAP("APRSTH", "aprsthnetwork");
    wifiMulti.addAP("BOUY", "aprsthnetwork");
    if (wifiMulti.run() == WL_CONNECTED)
    {
      // Serial.println("");
      log_d("Wi-Fi CONNECTED!");
      log_d("IP address: %s", WiFi.localIP().toString().c_str());
      webService();
      NTP_Timeout = millis() + 2000;
    }

    pingTimeout = millis() + 10000;
    unsigned long timeNetworkOld = millis();
    timeNetwork = 0;
    for (;;)
    {
      unsigned long now = millis();
      timeNetwork = now - timeNetworkOld;
      timeNetworkOld = now;
      // wdtNetworkTimer = millis();
      vTaskDelay(10 / portTICK_PERIOD_MS);
      {
        if (WiFi.status() == WL_CONNECTED)
        {
          serviceHandle();

          //         if (config.wifi_mode == WIFI_AP_STA_FIX || config.wifi_mode == WIFI_STA_FIX)
          //         {
          //             if (WiFi.status() != WL_CONNECTED)
          //             {
          //                 unsigned long int tw = millis();
          //                 if (tw > wifiTTL)
          //                 {
          // #ifndef I2S_INTERNAL
          //                     AFSK_TimerEnable(false);
          // #endif
          //                     wifiTTL = tw + 60000;
          //                     Serial.println("WiFi connecting..");
          //                     // udp.endPacket();
          //                     WiFi.disconnect();
          //                     WiFi.setTxPower((wifi_power_t)config.wifi_power);
          //                     WiFi.setHostname("ESP32IGate");
          //                     WiFi.begin(config.wifi_ssid, config.wifi_pass);
          //                     // Wait up to 1 minute for connection...
          //                     for (c = 0; (c < 30) && (WiFi.status() != WL_CONNECTED); c++)
          //                     {
          //                         // Serial.write('.');
          //                         vTaskDelay(1000 / portTICK_PERIOD_MS);
          //                         // for (t = millis(); (millis() - t) < 1000; refresh());
          //                     }
          //                     if (c >= 30)
          //                     { // If it didn't connect within 1 min
          //                         Serial.println("Failed. Will retry...");
          //                         WiFi.disconnect();
          //                         // WiFi.mode(WIFI_OFF);
          //                         delay(3000);
          //                         // WiFi.mode(WIFI_STA);
          //                         WiFi.reconnect();
          //                         continue;
          //                     }

          //                     Serial.println("WiFi connected");
          //                     Serial.print("IP address: ");
          //                     Serial.println(WiFi.localIP());

          //                     vTaskDelay(1000 / portTICK_PERIOD_MS);
          //                     NTP_Timeout = millis() + 5000;
          // // Serial.println("Contacting Time Server");
          // // configTime(3600 * timeZone, 0, "aprs.dprns.com", "1.pool.ntp.org");
          // // vTaskDelay(3000 / portTICK_PERIOD_MS);
          // #ifndef I2S_INTERNAL
          //                     AFSK_TimerEnable(true);
          // #endif
          //                 }
          //             }
          //             else
          //             {

          if (millis() > NTP_Timeout)
          {
            NTP_Timeout = millis() + 86400000;
            // Serial.println("Config NTP");
            // setSyncProvider(getNtpTime);
            log_d("Contacting Time Server\n");
            configTime(3600 * config.timeZone, 0, "203.150.19.26", "110.170.126.101", "77.68.122.252");
            vTaskDelay(1000 / portTICK_PERIOD_MS);
            time_t systemTime;
            time(&systemTime);
            setTime(systemTime);
            if (systemUptime == 0)
            {
              systemUptime = time(NULL);
            }
            pingTimeout = millis() + 2000;
          }

          if (config.aprs)
          {
            if (aprsClient.connected() == false)
            {
              APRSConnect();
            }
            else
            {
              if (aprsClient.available())
              {
                pingTimeout = millis() + 300000;                // Reset ping timout
                String line = aprsClient.readStringUntil('\n'); // อ่านค่าที่ Server ตอบหลับมาทีละบรรทัด
#ifdef DEBUG_IS
                printTime();
                Serial.print("APRS-IS ");
                Serial.println(line);
#endif
                status.isCount++;
                int start_val = line.indexOf(">", 0); // หาตำแหน่งแรกของ >
                if (start_val > 3)
                {
                  // if (config.dispINET == true){
                  //     if(!dispBuffer.isFull()) dispBuffer.push(line.c_str());
                  // }

                  char *raw = (char *)malloc(line.length() + 1);
                  String src_call = line.substring(0, start_val);
                  String msg_call = "::" + src_call;

                  status.allCount++;
                  igateTLM.RX++;
                  if (config.tnc && config.inet2rf)
                  {
                    if (line.indexOf(msg_call) <= 0) // src callsign = msg callsign ไม่ใช่หัวข้อโทรมาตร
                    {
                      if (line.indexOf(":T#") < 0) // ไม่ใช่ข้อความโทรมาตร
                      {
                        if (line.indexOf("::") > 0) // ข้อความเท่านั้น
                        {                           // message only
                          // raw[0] = '}';
                          // line.toCharArray(&raw[1], line.length());
                          // tncTxEnable = false;
                          // SerialTNC.flush();
                          // SerialTNC.println(raw);
                          pkgTxUpdate(line.c_str(), 0);
                          // APRS_sendTNC2Pkt(line); // Send out RF by TNC build in
                          //  tncTxEnable = true;
                          status.inet2rf++;
                          igateTLM.INET2RF++;
#ifdef DEBUG
                          // printTime();
                          log_d("INET->RF ");
                          log_d("%s\n", line.c_str());
#endif
                        }
                      }
                    }
                    else
                    {
                      igateTLM.DROP++;
                      log_d("INET Message TELEMETRY from ");
                      log_d("%s\n", src_call.c_str());
                      ;
                    }
                  }

                  memset(&raw[0], 0, sizeof(raw));
                  line.toCharArray(&raw[0], start_val + 1);
                  raw[start_val + 1] = 0;
                  // pkgListUpdate(&raw[0], 0);
                  uint8_t type = pkgType(&raw[0]);
                  int idx = pkgListUpdate((char *)src_call.c_str(), &raw[0], type);
                  pushTNC2Raw(idx);
                  free(raw);
                }
              }
            }
          }

          // if (millis() > pingTimeout)
          //                 {
          //                     pingTimeout = millis() + 3000;
          //                     Serial.print("Ping to " + vpn_IP.toString());
          //                     if (ping_start(vpn_IP, 3, 0, 0, 10) == true)
          //                     {
          //                         Serial.println("VPN Ping Success!!");
          //                     }
          //                     else
          //                     {
          //                         Serial.println("VPN Ping Fail!");
          //                     }
          //                 }

          if (millis() > pingTimeout)
          {
            pingTimeout = millis() + 300000;
            log_d("Ping GW to %s\n", WiFi.gatewayIP().toString().c_str());
            if (ping_start(WiFi.gatewayIP(), 3, 0, 0, 5) == true)
            {
              log_d("GW Success!!\n");
            }
            else
            {
              log_d("GW Fail!\n");
              WiFi.disconnect();
              wifiTTL = 0;
            }
          }
        }
      }
    }
  }
